Tekla Open API Reference for Tekla Structures 2025
ReinforcementPulloutElement.EndSymbolType Property
 Gets or sets the type of the ending marks.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ReinforcementPulloutElement.EndSymbols EndSymbolType { get; set; }
Public Property EndSymbolType As ReinforcementPulloutElement.EndSymbols
	Get
	Set
Property Value
Type: ReinforcementPulloutElement.EndSymbols
See Also
Reference
ReinforcementPulloutElement Class
Tekla.Structures.Drawing Namespace